Revit 2024 API
PlasticVinyl.PlasticvinylPatternAmount Property
 The property labeled "Amount" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string PlasticvinylPatternAmount { get; }
Visual Basic
Public Shared ReadOnly Property PlasticvinylPatternAmount As String
	Get
Visual C++
public:
static property String^ PlasticvinylPatternAmount {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 2".
See Also
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace